/* Includes ------------------------------------------------------------------*/
#include <main_export.h>
#include <local_misc.h>

// Это пространство или слой программы, в котором уже можно и нужно использовать возможности С++.
// Здесь будут только вставки на С

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
// Здесь код на С не стоит уже активно использовать, следут писать на С++

extern "C"
{
    /**
     * @brief
     * @retval None
     */
    // Точка входа, в этой функции исполняется код зазачи в потоке операционной системы
    void appxx_TODO(void) // (можно передать аргументы, это данные которые можно получать от других потоков ОС)
    {

        // TODO: здесь код на С++ который реализует логику данной задачи выполняемой в потоке исполнеия RTOS

        // Out to console
        char msg[64] = {0};

        sprintf(msg, "Hollo task\r\n");
        HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
    }
} // end extern "C"

/* Task code -----------------------------------------------------------------*/

// TODO:

/* Private function  ---------------------------------------------------------*/
